## Plan Result (prod-app-registrations)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Key Vault Secrets User-/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-core-infra/providers/Microsoft.KeyVault/vaults/infra-vault-sandbox&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Key Vault Secrets User-/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-core-infra/providers/Microsoft.KeyVault/vaults/infra-vault-sandbox"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-core-infra/providers/Microsoft.KeyVault/vaults/infra-vault-sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.this.azuread_application.this["Sandbox Cleanup"] has changed
  ~ resource "azuread_application" "this" {
      + group_membership_claims        = []
        id                             = "9a0befd8-8e37-4b60-b5c8-82f5d5775b8d"
      + identifier_uris                = []
        tags                           = []
        # (13 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.this.azuread_service_principal.this["Sandbox Cleanup"] has changed
  ~ resource "azuread_service_principal" "this" {
      + alternative_names            = []
        id                           = "c0579ea1-0637-4b45-bb30-c760c4cbe3e4"
      + notification_email_addresses = []
        tags                         = []
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":23,"Program":"tfcmt","SHA1":"","Target":"prod-app-registrations","Vars":{}} -->